In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

## Column 순서 변경

In [15]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[0:4,'survived':'age']
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

#### column 이름의 리스트 만들기

In [24]:
columns = list(df.columns.values)
columns

['survived', 'pclass', 'sex', 'age']

In [35]:
columns_sorted = sorted(columns)
columns_reversed = list(reversed(sorted(columns)))
print("sorted:", columns_sorted)
print("reversed:", columns_reversed)

sorted: ['age', 'pclass', 'sex', 'survived']
reversed: ['survived', 'sex', 'pclass', 'age']

In [26]:
df_sorted = df[columns_sorted]
df_sorted

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [36]:
df_reversed = df[columns_reversed]
df_reversed

   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

## Column 분리

In [38]:
df = pd.read_excel('../../../05000266/part6/주가데이터.xlsx', engine='openpyxl')
df.head()

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

In [39]:
df.dtypes

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

In [46]:
df['연월일'] = df['연월일'].astype(str)

In [55]:
dates = df['연월일'].str.split('-')

In [57]:
dates.head()

0    [2018, 07, 02]
1    [2018, 06, 29]
2    [2018, 06, 28]
3    [2018, 06, 27]
4    [2018, 06, 26]
Name: 연월일, dtype: object

In [64]:
df['year'] = dates.str.get(0)
df['month'] = dates.str.get(1)
df['day'] = dates.str.get(2)

In [65]:
df.head()

          연월일   당일종가  전일종가     시가     고가     저가     거래량  year month day
0  2018-07-02  10100   600  10850  10900  10000  137977  2018    07  02
1  2018-06-29  10700   300  10550  10900   9990  170253  2018    06  29
2  2018-06-28  10400   500  10900  10950  10150  155769  2018    06  28
3  2018-06-27  10900   100  10800  11050  10500  133548  2018    06  27
4  2018-06-26  10800   350  10900  11000  10700   63039  2018    06  26